# 'traceroute' and 'ping' in a single tool
# AI agent session manager - alpha channel
# AI agent session manager - beta channel
# Additional guest agents for Lima
# All-in-one calendars, tasks and scheduler
# Ambitious Vim-fork focused on extensibility and agility
# Android SDK component
# Anthropic's official Claude AI desktop app
# App to build and share containerised applications and microservices
# Automatic tiling window manager similar to xmonad
# Bash Automated Testing System
# CLI and dbus interface for WhisperSystems/libsignal-service-java
# CLI tool for Amazon ECS and AWS Fargate
# Calendar for professionals and teams
# Client for the Google Drive storage service
# Collaborative team software
# Command-line fuzzy finder written in Go
# Command-line interface for https://speedtest.net bandwidth tests
# Command-line tool to interact with Gitea servers
# Container runtimes on MacOS (and Linux) with minimal setup
# Control your Sonos system
# Create, run, and share large language models (LLMs)
# Cross-shell prompt for astronauts
# Desktop client for GitHub repositories
# Desktop password and login vault
# Development kit for the Java programming language
# Easily detect and prevent bugs and anti-patterns in your codebase
# Eclipse integrated development environment
# Emulates the detach feature of screen
# Execute binaries from Python packages in isolated environments
# File system integration
# Fish shell like syntax highlighting for zsh
# Fish-like fast/unobtrusive autosuggestions for zsh
# GNU Privacy Guard (OpenPGP)
# GNU Transport Layer Security (TLS) Library
# GNU implementation of the famous stream editor
# GPU-accelerated cross-platform terminal emulator and multiplexer
# GPU-based terminal emulator
# Generic machine emulator and virtualizer
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
# GitHub Markdown previewer
# GitHub command-line tool
# Graphical client for Git version control
# Internet file retriever
# Interpreted, interactive, object-oriented programming language
# JDK from the Eclipse Foundation (Adoptium)
# Java IDE by JetBrains
# Java-based project management
# JavaScript package manager
# JetBrains tools manager
# Knowledge base that works on top of a local folder of plain text Markdown files
# Lightweight and flexible command-line JSON processor
# Mac App Store command-line interface
# Manage multiple Node.js versions
# Matrix collaboration client
# Menu bar manager
# Minimal CLI coding agent
# Multimedia player
# Multipurpose automation tool for content
# Music streaming service
# Native desktop client for WhatsApp
# Non-interactive SSH password auth
# Official Amazon AWS command-line interface
# Online collaborative whiteboard platform
# Open source continuous file synchronization application
# Open source programming language to build simple/reliable/efficient software
# Open-source Markdown editor
# Open-source build automation tool based on the Groovy and Kotlin DSL
# Open-source code editor
# Open-source software for live streaming and screen recording
# Open-source, cross-platform JavaScript runtime environment
# PDF rendering library (based on the xpdf-3.0 code base)
# Pack, ship and run any application as a lightweight container
# Password manager app
# Paste PNG into files
# Pinentry for GPG on Mac
# Play, record, convert, and stream select audio and video codecs
# Port of OpenAI's Whisper model in C/C++
# Port scanning utility for large networks
# QR Code generation
# Real time file synchronisation software
# Remote terminal application
# Replacement for RCDefaultApps, written in Swift
# Rsync for cloud storage
# Ruby version manager
# Rust-based terminal
# SOund eXchange: universal sound sample translator
# Search tool like grep and The Silver Searcher
# Secure and free password manager for all of your devices
# Send push notifications to your phone or desktop via PUT/POST
# Shell extension to navigate your filesystem faster
# Simple, modern, secure file encryption
# Team communication and collaboration software
# Terminal emulator
# Terminal emulator that uses platform-native UI and GPU acceleration
# Terminal emulator, SSH and serial client
# Terminal multiplexer
# Terminal-based AI coding assistant
# Tools and libraries to manipulate images in select formats
# Tools for building Android applications
# Tools for the WireGuard secure network tunnel
# Tracks most-used directories to make cd smarter
# Unified GUI for command-line AI agents
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
# Video communication and virtual meeting platform
# Video game digital distribution service
# Visual client for Helix Core
# Visual diff and merge tool
# Voice and text chat software
# Web browser
# Window manager
# Zsh port of Fish shell's history search
brew "abook"
brew "age"
brew "ansible"
brew "aria2"
brew "automake"
brew "awscli"
brew "bats-core"
brew "bison"
brew "bitwarden-cli"
brew "boost"
brew "charmbracelet/tap/freeze"
brew "chruby"
brew "cocoapods"
brew "colima"
brew "copilot"
brew "docker"
brew "docker", link: false
brew "dotenv-linter"
brew "dtach"
brew "entr"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "flexget"
brew "fzf"
brew "gdbm"
brew "gh"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gradle"
brew "gradle@8"
brew "grip"
brew "handbrake"
brew "harfbuzz"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "heroku/brew/heroku"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "isync"
brew "jdupes"
brew "jenv"
brew "jpeg-xl"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "laurentftech/ntfy-macos/ntfy-macos"
brew "libassuan"
brew "libffi"
brew "libksba"
brew "libyaml"
brew "lima-additional-guestagents"
brew "localtunnel"
brew "lynx"
brew "mas"
brew "maven"
brew "mistral-vibe"
brew "mkvtoolnix"
brew "mosh"
brew "msmtp"
brew "mtr"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "node@24"
brew "notmuch"
brew "ntfy"
brew "nvm"
brew "ollama"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "openjdk@21", link: true
brew "openssl@3"
brew "oven-sh/bun/bun"
brew "pass"
brew "peonping/tap/peon-ping"
brew "pi-coding-agent"
brew "pinentry"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "postgresql@16", restart_service: :changed, link: true
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "qemu"
brew "qrencode"
brew "qt"
brew "rbenv"
brew "rclone"
brew "redis"
brew "repo"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "sbt"
brew "screenpipe"
brew "semgrep"
brew "signal-cli"
brew "sox"
brew "speedtest-cli"
brew "sqlite"
brew "sshpass"
brew "starship"
brew "stow"
brew "swift-format"
brew "syncthing"
brew "tea"
brew "tesseract"
brew "tmux"
brew "tree"
brew "unar"
brew "unbound"
brew "urlview"
brew "uv"
brew "volta"
brew "watch"
brew "watchman"
brew "wget"
brew "whisper-cpp"
brew "wireguard-tools"
brew "xz"
brew "yarn"
brew "yt-dlp"
brew "z"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "0-ad"
cask "1password"
cask "acyclic-eu/apps/eijii-alpha"
cask "acyclic-eu/apps/eijii-beta"
cask "aionui"
cask "amethyst"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "audacity"
cask "authy"
cask "bartender"
cask "bitwarden"
cask "blender"
cask "calibre"
cask "cerebro"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "cmux"
cask "curseforge"
cask "cyberduck"
cask "discord"
cask "docker"
cask "docker-desktop"
cask "eclipse-ide"
cask "element"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "epic-games"
cask "figma"
cask "firefox"
cask "flux"
cask "flux-app"
cask "font-monaspace"
cask "ghostty"
cask "gimp"
cask "gitbutler"
cask "github"
cask "godot"
cask "google-chrome"
cask "google-drive"
cask "gpodder"
cask "handbrake"
cask "handbrake-app"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keepassxc"
cask "keyboard-maestro"
cask "kitty"
cask "krita"
cask "local"
cask "loom"
cask "loop"
cask "macdown"
cask "macfuse"
cask "marta"
cask "meetingbar"
cask "meld"
cask "miro"
cask "mkchromecast"
cask "morgen"
cask "mp3tag"
cask "musicbrainz-picard"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "ollama-app"
cask "p4v"
cask "pearcleaner"
cask "pgadmin4"
cask "plex-media-server"
cask "plexamp"
cask "raycast"
cask "recut"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "swiftdefaultappsprefpane"
cask "syncthing"
cask "syncthing-app"
cask "tabby"
cask "temurin@21"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "vlc"
cask "voiceink"
cask "warp"
cask "wave"
cask "wezterm"
cask "whatsapp"
cask "zoom"
mas "Actions For Obsidian", id: 1659667937
mas "Bitwarden", id: 1352778147
mas "Browser Ninja", id: 995838410
mas "DaVinci Resolve", id: 571213070
mas "Draw Things", id: 6444050820
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "IP Scanner", id: 6443819966
mas "In Your Face", id: 1476964367
mas "Keynote", id: 409183694
mas "MenubarTrimmer", id: 6743372418
mas "Numbers", id: 409203825
mas "OLW", id: 1529988877
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "QR Capture", id: 1369524274
mas "Shortcut Notch", id: 6447055708
mas "Shortery", id: 1594183810
mas "SnailGit Lite", id: 1099475282
mas "Steam Link", id: 1246969117
mas "TaskForge", id: 6744716215
mas "UTM", id: 1538878817
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
npm "@ifi/pi-extension-subagents"
npm "@jfim/obsidian-tasks-mcp"
npm "@juicesharp/rpiv-advisor"
npm "@juicesharp/rpiv-args"
npm "@juicesharp/rpiv-ask-user-question"
npm "@juicesharp/rpiv-btw"
npm "@juicesharp/rpiv-todo"
npm "@juicesharp/rpiv-web-tools"
npm "@llblab/pi-telegram"
npm "@marp-team/marp-cli"
npm "@ollama/pi-web-search"
npm "decktape"
npm "pi-cmux"
npm "pi-kanban"
npm "pi-mcp-adapter"
npm "pi-peon-ping"
npm "pnpm"
tap "acyclic-eu/apps"
tap "acyclic-eu/eijii"
tap "anomalyco/tap"
tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "koekeishiya/formulae"
tap "laurentftech/ntfy-macos"
tap "oven-sh/bun"
tap "peonping/tap"
tap "peonping/tap", "https://github.com/PeonPing/homebrew-tap"
vscode "bierner.markdown-preview-github-styles"
vscode "codescene.codescene-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dedsec727.jekyll-run"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "googlecloudtools.cloudcode"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "osteele.jekyll"
vscode "oxc.oxc-vscode"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sissel.shopify-liquid"
vscode "styled-components.vscode-styled-components"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "xabikos.reactsnippets"
vscode "yzane.markdown-pdf"
