tap "acyclic-eu/apps"
tap "acyclic-eu/eijii"
tap "anomalyco/tap"
tap "charmbracelet/tap"
tap "laurentftech/ntfy-macos"
tap "peonping/tap"
brew "age"
brew "python@3.14"
brew "awscli"
brew "bats-core"
brew "bitwarden-cli"
brew "colima"
brew "copilot"
brew "docker"
brew "dtach"
brew "ffmpeg"
brew "flexget"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "gnutls"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "openjdk@21", link: true
brew "gradle@8"
brew "imagemagick"
brew "jq"
brew "qemu"
brew "lima-additional-guestagents"
brew "mas"
brew "maven"
brew "mistral-vibe"
brew "mosh"
brew "mtr"
brew "neovim"
brew "nmap"
brew "node@24"
brew "ntfy"
brew "nvm"
brew "ollama", restart_service: :changed
brew "pinentry-mac"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "qrencode"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "semgrep"
brew "signal-cli"
brew "sox"
brew "speedtest-cli"
brew "sshpass"
brew "starship"
brew "syncthing"
brew "tea"
brew "tmux"
brew "wget"
brew "whisper-cpp"
brew "wireguard-tools"
brew "yarn"
brew "z"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/freeze"
brew "peonping/tap/peon-ping"
cask "aionui"
cask "amethyst"
cask "android-platform-tools"
cask "android-studio"
cask "bitwarden"
cask "claude"
cask "claude-code"
cask "cmux"
cask "discord"
cask "docker-desktop"
cask "eclipse-ide"
cask "acyclic-eu/apps/eijii-alpha"
cask "acyclic-eu/apps/eijii-beta"
cask "element"
cask "figma"
cask "firefox"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keepassxc"
cask "kitty"
cask "loop"
cask "macdown"
cask "macfuse"
cask "meld"
cask "miro"
cask "morgen"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "p4v"
cask "pearcleaner"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "syncthing-app"
cask "tabby"
cask "temurin@21"
cask "visual-studio-code@insiders"
cask "vlc"
cask "warp"
cask "wave"
cask "wezterm"
cask "whatsapp"
cask "zoom"
mas "Actions For Obsidian", id: 1659667937
mas "Browser Ninja", id: 995838410
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MenubarTrimmer", id: 6743372418
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shortery", id: 1594183810
mas "TaskForge", id: 6744716215
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "bierner.markdown-preview-github-styles"
vscode "codescene.codescene-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dedsec727.jekyll-run"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "osteele.jekyll"
vscode "oxc.oxc-vscode"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sissel.shopify-liquid"
vscode "styled-components.vscode-styled-components"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "xabikos.reactsnippets"
vscode "yzane.markdown-pdf"
npm "@ifi/pi-extension-subagents"
npm "@jfim/obsidian-tasks-mcp"
npm "@juicesharp/rpiv-advisor"
npm "@juicesharp/rpiv-args"
npm "@juicesharp/rpiv-ask-user-question"
npm "@juicesharp/rpiv-btw"
npm "@juicesharp/rpiv-todo"
npm "@juicesharp/rpiv-web-tools"
npm "@llblab/pi-telegram"
npm "@marp-team/marp-cli"
npm "@ollama/pi-web-search"
npm "pi-cmux"
npm "pi-kanban"
npm "pi-mcp-adapter"
npm "pi-peon-ping"
npm "pnpm"
