tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "abook"
brew "openssl@3"
brew "libyaml"
brew "xz"
brew "python@3.13"
brew "ansible"
brew "aria2"
brew "automake"
brew "python@3.12"
brew "awscli"
brew "bison"
brew "glib"
brew "chruby"
brew "ruby"
brew "cocoapods"
brew "docker", link: false
brew "dotenv-linter"
brew "entr"
brew "exercism"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "libassuan"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "gnu-sed"
brew "openjdk"
brew "gradle"
brew "handbrake"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "isync"
brew "jdupes"
brew "jenv"
brew "jq"
brew "libffi"
brew "localtunnel"
brew "lynx"
brew "mas"
brew "maven"
brew "mkvtoolnix"
brew "mosh"
brew "msmtp"
brew "notmuch"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openjdk@21", link: true
brew "tree"
brew "pass"
brew "pipenv"
brew "pipx"
brew "postgresql@14"
brew "pyenv"
brew "python@3.11"
brew "rclone"
brew "redis"
brew "repo"
brew "ripgrep"
brew "ruby-install"
brew "sbt"
brew "stow"
brew "swift-format"
brew "syncthing"
brew "tmux"
brew "unar"
brew "urlview"
brew "uv"
brew "volta"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "z"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "oven-sh/bun/bun"
cask "0-ad"
cask "1password"
cask "amethyst"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "audacity"
cask "authy"
cask "bartender"
cask "blender"
cask "calibre"
cask "cerebro"
cask "claude"
cask "cleanshot"
cask "curseforge"
cask "cyberduck"
cask "discord"
cask "docker-desktop"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "epic-games"
cask "firefox"
cask "flux-app"
cask "font-monaspace"
cask "ghostty"
cask "gimp"
cask "gitbutler"
cask "github"
cask "godot"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "intellij-idea-ce"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kitty"
cask "local"
cask "loom"
cask "marta"
cask "meetingbar"
cask "miro"
cask "mkchromecast"
cask "mp3tag"
cask "musicbrainz-picard"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "ollama-app"
cask "pgadmin4"
cask "plex-media-server"
cask "plexamp"
cask "raycast"
cask "recut"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "swiftdefaultappsprefpane"
cask "syncthing-app"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zoom"
vscode "bierner.markdown-preview-github-styles"
vscode "codescene.codescene-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dedsec727.jekyll-run"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "osteele.jekyll"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sissel.shopify-liquid"
vscode "styled-components.vscode-styled-components"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "xabikos.reactsnippets"
vscode "yzane.markdown-pdf"
