brew "abook"
brew "ansible"
brew "aria2"
brew "awscli"
brew "chruby"
brew "entr"
brew "ffmpeg"
brew "gnu-sed"
brew "handbrake"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "heroku/brew/heroku"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "isync"
brew "jq"
brew "localtunnel"
brew "lynx"
brew "mas"
brew "mkvtoolnix"
brew "msmtp"
brew "neomutt"
brew "neovim"
brew "notmuch"
brew "oven-sh/bun/bun"
brew "pass"
brew "postgresql@14"
brew "python@3.11"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ruby-install"
brew "swift-format"
brew "syncthing"
brew "tmux"
brew "tree"
brew "unar"
brew "urlview"
brew "volta"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zoxide"
cask "0-ad"
cask "1password"
cask "amethyst"
cask "anki"
cask "audacity"
cask "authy"
cask "bartender"
cask "blender"
cask "cerebro"
cask "cleanshot"
cask "curseforge"
cask "discord"
cask "docker"
cask "epic-games"
cask "firefox"
cask "flux"
cask "font-monaspace"
cask "godot"
cask "google-chrome"
cask "google-drive"
cask "gpodder"
cask "handbrake"
cask "hiddenbar"
cask "imageoptim"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kitty"
cask "krita"
cask "local"
cask "loom"
cask "marta"
cask "miro"
cask "mp3tag"
cask "musicbrainz-picard"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "pgadmin4"
cask "plex-media-server"
cask "plexamp"
cask "raycast"
cask "recut"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "syncthing"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
mas "Actions For Obsidian", id: 1659667937
mas "Bitwarden", id: 1352778147
mas "Browser Ninja", id: 995838410
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "In Your Face", id: 1476964367
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OLW", id: 1529988877
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Shortery", id: 1594183810
mas "SnailGit Lite", id: 1099475282
mas "Steam Link", id: 1246969117
mas "iMovie", id: 408981434
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "oven-sh/bun"
