tap "anomalyco/tap"
brew "awscli"
brew "bats-core"
brew "bitwarden-cli"
brew "colima"
brew "copilot"
brew "docker", link: false
brew "python@3.14"
brew "flexget"
brew "gh"
brew "gnu-sed"
brew "gnutls"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "openjdk@21", link: true
brew "gradle@8"
brew "qemu"
brew "lima-additional-guestagents"
brew "mas"
brew "maven"
brew "mosh"
brew "neovim"
brew "nmap"
brew "nvm"
brew "ollama", restart_service: :changed
brew "pinentry-mac"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "ripgrep"
brew "semgrep"
brew "sshpass"
brew "syncthing"
brew "wget"
brew "yarn"
brew "z"
brew "zoxide"
cask "aionui"
cask "amethyst"
cask "android-platform-tools"
cask "android-studio"
cask "bitwarden"
cask "claude"
cask "claude-code"
cask "discord"
cask "docker-desktop"
cask "eclipse-ide"
cask "element"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "kitty"
cask "loop"
cask "macdown"
cask "macfuse"
cask "miro"
cask "morgen"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "pearcleaner"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "syncthing-app"
cask "temurin@21"
cask "visual-studio-code@insiders"
cask "vlc"
cask "voiceink"
cask "wave"
cask "whatsapp"
cask "zoom"
mas "Actions For Obsidian", id: 1659667937
mas "Browser Ninja", id: 995838410
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MenubarTrimmer", id: 6743372418
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shortery", id: 1594183810
mas "TaskForge", id: 6744716215
mas "Xcode", id: 497799835
vscode "bierner.markdown-preview-github-styles"
vscode "codescene.codescene-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dedsec727.jekyll-run"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "osteele.jekyll"
vscode "oxc.oxc-vscode"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sissel.shopify-liquid"
vscode "styled-components.vscode-styled-components"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "xabikos.reactsnippets"
vscode "yzane.markdown-pdf"
