## brew "ffmpeg"
## brew "hugo"
## brew "imagemagick"
## brew "jq"
## brew "mkvtoolnix"
## brew "python@3.11"
## brew "rclone"
## brew "unar"
## cask "1password"
## cask "arq"
## cask "bartender"
## cask "blender"
## cask "calibre"
## cask "kitty"
## cask "netnewswire"
## cask "plex-media-server"
## cask "plexamp"
## cask "raycast"
## cask "tailscale"
## cask "the-unarchiver"
## cask "transmission"
## cask "unity-hub"
## cask "vlc"
## cask intellij-idea
##cask "epic-games"
brew "gnu-sed"
brew "neovim"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
cask "0-ad"
cask "0-ad"
cask "amethyst"
cask "authy"
cask "discord"
cask "discord"
cask "docker"
cask "docker"
cask "google-drive"
cask "google-drive"
cask "handbrake"
cask "handbrake"
cask "karabiner-elements"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "sonos"
cask "spotify"
cask "steam"
cask "visual-studio-code"
